{ 
    "account-part-of-organizations":"Ensure your AWS account is part of AWS Organizations. This can be done via the AWS Management Console under AWS Organizations.",
    "cloud-trail-cloud-watch-logs-enabled":"To integrate CloudTrail with CloudWatch Logs, see Sending events to CloudWatch Logs in the AWS CloudTrail User Guide.",
    "cloud-trail-encryption-enabled":"To enable SSE-KMS encryption for CloudTrail log files, see Update a trail to use a KMS key in the AWS CloudTrail User Guide.",
    "cloud-trail-log-file-validation-enabled":"To enable CloudTrail log file validation, see Enabling log file integrity validation for CloudTrail in the AWS CloudTrail User Guide.",
    "cloudtrail-enabled":"\n**From Portal**\n\n1. Sign in to the AWS Management Console.\n\n2. Navigate to CloudTrail dashboard at https://console.aws.amazon.com/cloudtrail/.\n\n3. In the left navigation panel, select Trails.\n\n4. Under Name column, select the trail name that you need to update.\n\n5. Under the trail name, search for the Apply trail to all regions status and click the pencil icon next to the status current value.\n\n6. Select Yes to enable the feature and click Save.",
    "cloudtrail-s3-dataevents-enabled":"1. Sign in to the AWS Management Console and open the Amazon S3 console at https://console.aws.amazon.com/s3/. 2. In the Buckets list, choose the name of the bucket. 3. Choose Properties. 4. Under AWS CloudTrail data events, choose Configure in CloudTrail.",
    "ebs-in-backup-plan":"Log in to your AWS console and go to  AWS Backup service: https://console.aws.amazon.com/backup/. Click on Backup plan in the left navigation pane Choose your Backup plans and go to the Resource assignment section. In this section, you can see EBS volumes is assigned or not for the Backup plan if not then follow the implementation steps",
    "ec2-ebs-encryption-by-default":"1. Open the Amazon EC2 console. 2. In the navigation bar, select the Region. 3. In the navigation pane, choose EC2 Dashboard. 4. In the upper-right corner, choose Account Attributes, EBS encryption. 5. Choose Manage. 6. For Always encrypt new EBS volumes, choose Enable. 7. Choose Default encryption key, and then select any of your keys to set as the default. 8. Choose Update EBS encryption.",
    "ec2-instance-detailed-monitoring-enabled":"1. Open the Amazon EC2 console at https://console.aws.amazon.com/ec2/. 2. In the navigation pane, choose Instances. 3. Select the instance and choose Actions, Monitoring, Manage detailed monitoring. 4. On the Detailed monitoring detail page, for Detailed monitoring, select the Enable check box. 5. Choose Save.",
    "ec2-instance-managed-by-systems-manager":"To manage EC2 instances with Systems Manager, see Amazon EC2 host management in the AWS Systems Manager User Guide. In the Configuration options section, you can keep the default choices or change them as necessary for your preferred configuration.",
    "ec2-instance-no-public-ip":"Ensure EC2 instances don't have public IPs. Modify the instance properties to disassociate the public IP.",
    "ec2-instance-profile-attached":"Sign in to the AWS Management Console. Go to the EC2 dashboard at https://console.aws.amazon.com/ec2/. Click on Instances, in the left navigation pane Select the instance that you want to examine In the Details tab at the bottom check whether the IAM role is attached or not If you notice no role is attached it means IAM role is not attached to instance",
    "ec2-security-group-attached-to-eni":"Open the Amazon EC2 console at https://console.aws.amazon.com/ec2/. In the navigation pane, choose Security groups. Click on a security group you want to verity if it connected to ENI (Elastic Network Interface). Copy the security group ID. Now in the navigation pane, choose Network Interfaces. In the search pane, select security group IDs filter and paste the security group ID. Results will show if the security group is attached to Network Interface.",
    "encrypted-volumes":"1. Open the Amazon EC2 console at https://console.aws.amazon.com/ec2/. 2. From the navigation bar, select the Region. 3. From the navigation pane, select EC2 Dashboard. 4. In the upper-right corner of the page, choose Account Attributes, Data protection and security. 5. Choose Manage. 6. For Default encryption key, choose a symmetric customer managed encryption key. 7. Choose Update EBS encryption.",
    "iam-password-policy":"Go to AWS Management Console: https://console.aws.amazon.com/iam/ Navigate to IAM Services. Under Access management go to Account settings. Select 'Change password policy'. Select 'Prevent password reuse'. Set '24' in the Remember passwords. Click save changes.",
    "iam-user-mfa-enabled":"Log in to the AWS Management Console. Click on the AWS account name at the top on AWS management console and click on the 'Security Credentials' from the menu. On 'My security credentials' page scroll down and click on the 'Multi-factor authentication (MFA)'. Check the 'Multi-factor authentication (MFA)' section for any active devices. If the 'Assign MFA device' button is showing then a multi-factor authentication device is not enabled for the root account. On 'My security credentials' page scroll down and click on the 'Multi-factor authentication (MFA)' and click on the 'Assign MFA device' button to enable a multi-factor authentication device. Select 'Virtual MFA device' and click on 'Continue' button. Now install the AWS MFA compatible application on mobile device or computer. Once the application is installed click on the 'Show QR code' and scan the code with pre-installed application. Enter two consecutive MFA codes generated from application in 'MFA code 1' and 'MFA code 2' and click on the 'Assign MFA' button. On successful setup you will get the message 'You have successfully assigned virtual MFA'. Now 'Multi-factor authentication (MFA)' is enabled for the root account. Repeat steps number 2 to 8 to check another AWS account.",
    "internet-gateway-authorized-vpc-only":"Login to AWS Management Console Go to the VPC dashboard at https://console.aws.amazon.com/vpc/ Click on Internet Gateway in the left navigation pane and choose Internet Gateways which you want to examine Click on the Actions and select View Details In the details, you can see Internet gateway ID - igw-xxxxxxx and its state, if it is connected with VPC you can see VPC Id in your Internet Gateway",
    "root-account-hardware-mfa-enabled":"1. Log in with the root account, then go to the root account security credentials tab at: https://console.aws.amazon.com/iam/home#/security_credentials 2. Select the 'Multi-factor authentication (MFA)' tab.3. Select the 'Activate MFA' button. 4. Follow the setup steps displayed in the popup window to configure the MFA device. It is recommended to use hardware MFA for the root account if possible, but virtual MFA is preferred to no MFA at all.",
    "s3-account-level-public-access-blocks-periodic":"To remediate this, configure a block public access configuration on each S3 bucket.",
    "s3-bucket-logging-enabled":"Login to the AWS Management Console at https://console.aws.amazon.com/. Open the Amazon S3 console. Navigate to the Bucket name list. To enable server access logging for a bucket, select the name of the bucket. Click Properties. Click Server access logging. For the target, select the name of the bucket that you want to receive the log record objects. Click Enable Logging. Note: The target bucket must be in the same Region as the source bucket and must not have a default retention period configuration.",
    "s3-bucket-replication-enabled":"https://docs.aws.amazon.com/AmazonS3/latest/userguide/replication-walkthrough1.html",
    "s3-bucket-ssl-requests-only":"https://repost.aws/knowledge-center/s3-bucket-policy-for-config-rule",
    "s3-bucket-versioning-enabled":"https://docs.aws.amazon.com/AmazonS3/latest/userguide/manage-versioning-examples.html",
    "s3-default-encryption-kms":"https://docs.aws.amazon.com/AmazonS3/latest/userguide/default-bucket-encryption.html",
    "securityhub-enabled":"Use the credentials of the IAM identity to sign in to the Security Hub console. When you open the Security Hub console for the first time, choose Enable AWS Security Hub. On the welcome page, Security standards lists the security standards that Security Hub supports. To enable a standard, select its check box. To disable a standard, clear its check box. You can enable or disable a standard or its individual controls at any time. For information about the security standards and how to manage them, see Security controls and standards in AWS Security Hub. Choose Enable Security Hub.",
    "shield-advanced-enabled-autorenew":"Using AWS console: Sign in to AWS Management console https://console.aws.amazon.com/wafv2/shieldv2#/ Navigate to AWS Shield on left and click on Getting started. Choose to Subscribe to Shield Advanced. Agree to Auto renewal and click on Subscribe to Shield Advanced.",
    "vpc-default-security-group-closed":"1. Login to the AWS Management Console (https://console.aws.amazon.com/vpc/home). 2. Repeat the following steps for all VPCs, including the default VPC in each AWS region. 3. In the left pane under 'Security', click 'Security Groups'. 4. Select the default security group. 5. Under the 'Inbound rules' tab, click on 'Edit inboud rules' 6. Delete all inbound rules & click on 'Save rules'. 7. Under the 'Outbound rules' tab, click on 'Edit outbound rules' 8. Delete all outbound rules & click on 'Save rules'",
    "vpc-sg-open-only-to-authorized-ports":""
}